Revit 2024 API
AssetSet.Insert Method
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	Asset item
)
Visual Basic
Public Overridable Function Insert ( _
	item As Asset _
) As Boolean
Visual C++
public:
virtual bool Insert(
	Asset^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Visual.Asset
See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace